; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v3 - type_3)
 	      (pred_1 ?v1 - object ?v3 - type_3)
	      (pred_2 ?v4 - type_1 ?v7 - type_2)
	      (pred_4 ?v4 - type_1 ?v1 - object ?v7 - type_2))

   (:action op_2
       :parameters  (?v4 - type_1 ?v5 ?v2 - type_3)
       :precondition (and  (pred_3 ?v4 ?v5))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_1 ?v8 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v6) (pred_3 ?v4 ?v6) (pred_2 ?v4 ?v7))
       :effect (and (pred_4 ?v4 ?v8 ?v7)
		    (not (pred_1 ?v8 ?v6)) 
		    (not (pred_2 ?v4 ?v7))))

   (:action op_3
       :parameters (?v4 - type_1 ?v8 - object ?v6 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v8 ?v7) (pred_3 ?v4 ?v6))
       :effect (and (pred_1 ?v8 ?v6)
		    (pred_2 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v8 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_10 - type_1
obj_04 obj_06 obj_02 obj_01 - type_2
obj_11 obj_03 obj_07 obj_09 - type_3
obj_05 obj_12 obj_08 - object)
(:init
(pred_3 obj_13 obj_11)
(pred_2 obj_13 obj_04)
(pred_2 obj_13 obj_06)
(pred_3 obj_10 obj_03)
(pred_2 obj_10 obj_02)
(pred_2 obj_10 obj_01)
(pred_1 obj_05 obj_09)
(pred_1 obj_12 obj_11)
(pred_1 obj_08 obj_03)
)
(:goal
(and
(pred_1 obj_05 obj_09)
(pred_1 obj_12 obj_07)
(pred_1 obj_08 obj_09)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_07)))
)
)

; plan
1. (op_1 obj_13 obj_12 obj_11 obj_06)
   deleted: (pred_1 obj_12 obj_11) (pred_2 obj_13 obj_06)
   added: (pred_4 obj_13 obj_12 obj_06)
   goals met: 1 of 3
2. (op_1 obj_10 obj_08 obj_03 obj_01)
   deleted: (pred_1 obj_08 obj_03) (pred_2 obj_10 obj_01)
   added: (pred_4 obj_10 obj_08 obj_01)
   goals met: 1 of 3
3. (op_2 obj_10 obj_03 obj_09)
   deleted: (pred_3 obj_10 obj_03)
   added: (pred_3 obj_10 obj_09)
   goals met: 1 of 3
4. (op_2 obj_13 obj_11 obj_09)
   deleted: (pred_3 obj_13 obj_11)
   added: (pred_3 obj_13 obj_09)
   goals met: 1 of 3
5. (op_3 obj_10 obj_08 obj_09 obj_01)
   deleted: (pred_4 obj_10 obj_08 obj_01)
   added: (pred_1 obj_08 obj_09) (pred_2 obj_10 obj_01)
   goals met: 2 of 3
6. (op_3 obj_13 obj_12 obj_09 obj_06)
   deleted: (pred_4 obj_13 obj_12 obj_06)
   added: (pred_1 obj_12 obj_09) (pred_2 obj_13 obj_06)
   goals met: 2 of 3
7. (op_1 obj_10 obj_12 obj_09 obj_01)
   deleted: (pred_1 obj_12 obj_09) (pred_2 obj_10 obj_01)
   added: (pred_4 obj_10 obj_12 obj_01)
   goals met: 2 of 3
8. (op_2 obj_10 obj_09 obj_07)
   deleted: (pred_3 obj_10 obj_09)
   added: (pred_3 obj_10 obj_07)
   goals met: 2 of 3
9. (op_3 obj_10 obj_12 obj_07 obj_01)
   deleted: (pred_4 obj_10 obj_12 obj_01)
   added: (pred_1 obj_12 obj_07) (pred_2 obj_10 obj_01)
   goals met: 3 of 3
